ranger.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux - Ranger</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linux - Ranger</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga8f3450">Installation</a></li>
<li><a href="#org21f298a">Configuration</a></li>
<li><a href="#orgab45e00">Usage</a>
<ul>
<li><a href="#org0630b63">Macro</a></li>
<li><a href="#org07e801f">Tag</a></li>
<li><a href="#org1673339">Filter</a></li>
<li><a href="#orgdbebc03">Flatten</a></li>
<li><a href="#org2dac02f"><span class="todo TODO">TODO</span> Rename</a></li>
<li><a href="#orgfd03363">Keybinding</a></li>
<li><a href="#org16f8167">Get help</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/ranger/ranger">Ranger</a> is a popular and powerful file manager in console.
</p>

<div id="outline-container-orga8f3450" class="outline-2">
<h2 id="orga8f3450">Installation</h2>
<div class="outline-text-2" id="text-orga8f3450">
<p>
In archlinux, ranger can be directly installed using <code>pacman</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell">pacman -S ranger
</pre>
</div>
</div>
</div>
<div id="outline-container-org21f298a" class="outline-2">
<h2 id="org21f298a">Configuration</h2>
<div class="outline-text-2" id="text-org21f298a">
<p>
Ranger can be customized by 4 configuration files below.
</p>
<ul class="org-ul">
<li><code>rc.conf</code> organizes various options and keybindings.</li>
<li><code>commands.py</code> defines commands, which can be provoked via <code>:</code>.</li>
<li><code>rifle.conf</code> defines the default programs to open each type of files.</li>
<li><code>scope.sh</code> is a shell script to preview each type of files.</li>
</ul>

<p>
In fact, there are both global and local versions for each configuration above. The local versions are stored in <code>~/.config/ranger</code>. Optionally, the global version of the configuration files can be copied as follows to <code>~/.config/ranger</code> as a starting point before further customization, i.e.,
</p>
<div class="org-src-container">
<pre class="src src-shell">ranger --copy-config=rc/rifle/commands/scope/all
</pre>
</div>

<p>
For <code>rc.conf</code> and <code>commands</code>, ranger subsequently loads the global version first and then the local version. By default, only the options different from the default values in the global version need to be overridden in the local counterpart. The loading of global version can be skipped by setting environment variable <code>RANGER_LOAD_DEFAULT_RC</code> to <code>FALSE</code>.
</p>

<p>
For <code>scope.sh</code> and <code>rifle.conf</code>, what is different, ranger loads either the local or the global version.
</p>
</div>
</div>

<div id="outline-container-orgab45e00" class="outline-2">
<h2 id="orgab45e00">Usage</h2>
<div class="outline-text-2" id="text-orgab45e00">
</div>
<div id="outline-container-org0630b63" class="outline-3">
<h3 id="org0630b63">Macro</h3>
<div class="outline-text-3" id="text-org0630b63">
<p>
Following macros are defined to facilitate the commands in range console.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Macro</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>%f</code></td>
<td class="org-left">The highlighted file</td>
</tr>

<tr>
<td class="org-left"><code>%d</code></td>
<td class="org-left">Path of current directory</td>
</tr>

<tr>
<td class="org-left"><code>%p</code></td>
<td class="org-left">Full paths of the selected files</td>
</tr>

<tr>
<td class="org-left"><code>%s</code></td>
<td class="org-left">Selected files in the current directory</td>
</tr>

<tr>
<td class="org-left"><code>%t</code></td>
<td class="org-left">Tagged files in the current directory</td>
</tr>

<tr>
<td class="org-left"><code>%c</code></td>
<td class="org-left">Full paths of the currently copied/cut files</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org07e801f" class="outline-3">
<h3 id="org07e801f">Tag</h3>
<div class="outline-text-3" id="text-org07e801f">
<p>
A tag is a single character<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> displayed to the left of a filename.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Keybinding</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>t</code></td>
<td class="org-left">Tag/untag on current file.</td>
</tr>

<tr>
<td class="org-left"><code>ut</code></td>
<td class="org-left">Remove tags from the selected files.</td>
</tr>

<tr>
<td class="org-left"><code>"&lt;character&gt;</code></td>
<td class="org-left">Set <code>&lt;character&gt;</code> as a tag for a file.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1673339" class="outline-3">
<h3 id="org1673339">Filter</h3>
<div class="outline-text-3" id="text-org1673339">
<p>
Command <code>:filter &lt;regexp&gt;</code> can be used to filter files matching regular expression <code>&lt;regexp&gt;</code>. Particularly, <code>:filter</code> can clear and reset the filter.
</p>

<p>
<code>:filter_stack</code> is used to combine a series of filters with desired combinator, e.g., <code>.&amp;</code> for <code>AND</code> combinator and <code>.|</code> for <code>OR</code> combinator.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Keybinding</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>.</code></td>
<td class="org-left">Prefix for filter related operations</td>
</tr>

<tr>
<td class="org-left"><code>.c</code></td>
<td class="org-left">Clear <code>filter_statck</code>.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdbebc03" class="outline-3">
<h3 id="orgdbebc03">Flatten</h3>
<div class="outline-text-3" id="text-orgdbebc03">
<p>
Command <code>:flat &lt;n&gt;</code> can flatten a nested directory tree within <code>n</code> levels. Particularly,
</p>
<ul class="org-ul">
<li>n=-1 means infinite levels, i.e., no limit.</li>
<li>n=0 disables the flat view.</li>
</ul>
</div>
</div>
<div id="outline-container-org2dac02f" class="outline-3">
<h3 id="org2dac02f"><span class="todo TODO">TODO</span> Rename</h3>
</div>
<div id="outline-container-orgfd03363" class="outline-3">
<h3 id="orgfd03363">Keybinding</h3>
<div class="outline-text-3" id="text-orgfd03363">
<p>
Ranger comes up with vim-like keybindings, e.g.,
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Keybinding</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left">Close the current tabaz<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.</td>
</tr>

<tr>
<td class="org-left"><code>j/k</code></td>
<td class="org-left">Move down/up.</td>
</tr>

<tr>
<td class="org-left"><code>h</code></td>
<td class="org-left">Enter parent directory.</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left">Enter the selected directory.</td>
</tr>

<tr>
<td class="org-left"><code>i</code></td>
<td class="org-left">Preview the selected file.</td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left">Go to</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left"><code>:open_with</code></td>
</tr>

<tr>
<td class="org-left"><code>y</code></td>
<td class="org-left">Yank/copy</td>
</tr>

<tr>
<td class="org-left"><code>yy</code></td>
<td class="org-left">Copy file(s).</td>
</tr>

<tr>
<td class="org-left"><code>yd</code></td>
<td class="org-left">Copy directory as text.</td>
</tr>

<tr>
<td class="org-left"><code>yn</code></td>
<td class="org-left">Copy file name as text.</td>
</tr>

<tr>
<td class="org-left"><code>yp</code></td>
<td class="org-left">Copy file path (with name) as text.</td>
</tr>

<tr>
<td class="org-left"><code>ya</code></td>
<td class="org-left">Copy and append file(s) to the clipboard buffer.</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">Cut/delete</td>
</tr>

<tr>
<td class="org-left"><code>dd</code></td>
<td class="org-left">Cut file(s).</td>
</tr>

<tr>
<td class="org-left"><code>da</code></td>
<td class="org-left">Cut and append file(s) to the clipboard.</td>
</tr>

<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left">Paste</td>
</tr>

<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left">Sort/order</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">Undo</td>
</tr>

<tr>
<td class="org-left"><code>m&lt;key&gt;</code></td>
<td class="org-left">Bookmark the current folder with <code>key</code>.</td>
</tr>

<tr>
<td class="org-left"><code>'&lt;key&gt;</code></td>
<td class="org-left">Access the folder bookmarked by <code>key</code>.</td>
</tr>

<tr>
<td class="org-left"><code>''</code></td>
<td class="org-left">Move back.</td>
</tr>

<tr>
<td class="org-left"><code>Alt-&lt;n&gt;</code></td>
<td class="org-left">Create or switch to tab <code>n</code>.</td>
</tr>

<tr>
<td class="org-left"><code>space</code></td>
<td class="org-left">Mark the current file.</td>
</tr>

<tr>
<td class="org-left"><code>v</code></td>
<td class="org-left">Invert the selection.</td>
</tr>

<tr>
<td class="org-left"><code>V</code></td>
<td class="org-left">Enter a visual mode to mark a range of files.</td>
</tr>

<tr>
<td class="org-left"><code>:mark/unmark &lt;regexp&gt;</code></td>
<td class="org-left">Mark/unmark files matching <code>regexp</code>.</td>
</tr>

<tr>
<td class="org-left"><code>:mark/unmark_tag &lt;tag&gt;</code></td>
<td class="org-left">Mark/unmark files by <code>tag</code>.</td>
</tr>

<tr>
<td class="org-left"><code>tab/shift-tab</code></td>
<td class="org-left">Switch to next/previous tab.</td>
</tr>

<tr>
<td class="org-left"><code>M</code></td>
<td class="org-left">Linemode</td>
</tr>

<tr>
<td class="org-left"><code>+/-/=</code></td>
<td class="org-left">Set access right to files</td>
</tr>

<tr>
<td class="org-left"><code>z</code></td>
<td class="org-left">Change the settings of ranger in the current session.</td>
</tr>

<tr>
<td class="org-left"><code>zh</code></td>
<td class="org-left">Show/hide hidden files.</td>
</tr>

<tr>
<td class="org-left"><code>zi</code></td>
<td class="org-left">Toggle image preview.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org16f8167" class="outline-3">
<h3 id="org16f8167">Get help</h3>
<div class="outline-text-3" id="text-org16f8167">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Keybinding</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">Get help.</td>
</tr>

<tr>
<td class="org-left"><code>?m</code></td>
<td class="org-left">Man page for ranger.</td>
</tr>

<tr>
<td class="org-left"><code>?k</code></td>
<td class="org-left">List of keybindings.</td>
</tr>

<tr>
<td class="org-left"><code>?c</code></td>
<td class="org-left">List of commands.</td>
</tr>

<tr>
<td class="org-left"><code>?s</code></td>
<td class="org-left">List of options and their values.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The default tag is an asterisk (<code>*</code>).
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Or even quit the ranger (if it is the last tab).
</p></div></div>


</div>
</div></div>
</body>
</html>
